1. Các config cơ bản

```
# Hostname
sontest#conf t
sontest(config)#hostname sontest1
sontest1(config)#

#Set pass cho user admin 
sontest1(config)#username admin password admin@1234
sontest1(config)#enable password admin@456          # pass để vào mode config

#Cấu hình ip VLan
sontest1(config)#int vlan 1
sontest1(config-if)#ip address 172.16.5.102 255.255.240.0

# Cấu hình default gateway
sontest1(config)#ip default-gateway 172.16.10.1

#Cấu hình 1 port để làm port management 
sontest1(config)#int Gi1/0/1
sontest1(config-if)#switchport mode access
sontest1(config-if)#switchport access vlan 1
```

```
line vty 0 4
 login local

```


2. Đồng bộ NTP

- Cài đặt ntp servr cent 7
timedatectl set-timezone Asia/Ho_Chi_Minh
`yum install -y chrony`
`systemctl enable --now chronyd`
Tắt selinux

`vi cat /etc/chrony.conf`  # Chỉnh sửa allow server cần đồng bộ
timedatectl #Kiểm tra đồng bộ NTP sync = yes

- Trên switch:

```
ntp peer 172.16.5.105 source Vlan1

sontest1(config)#clock timezone GMT 7 0
sontest1#sh ntp associations

      address         ref clock     st  when  poll reach  delay  offset    disp
*~172.16.5.105     45.32.55.38       3    26   128  377     3.4   -1.41     1.0
 * master (synced), # master (unsynced), + selected, - candidate, ~ configured


sontest1#sh nt status
Clock is synchronized, stratum 4, reference is 172.16.5.105
nominal freq is 119.2092 Hz, actual freq is 119.2083 Hz, precision is 2**18
reference time is E70B1D21.0A905743 (04:20:49.041 UTC Tue Nov 1 2022)
clock offset is 6.9436 msec, root delay is 51.01 msec
root dispersion is 45.32 msec, peer dispersion is 1.01 msec
```

3. Tạo, xóa vlan

```
sontest1(config)#vlan 112
sontest1(config-vlan)#name D

#Allow port vlan
sontest1(config)#int range Gi1/0/2-10
sontest1(config-if-range)#switchport mode access
sontest1(config-if-range)#switchport access vlan 112
```

4. Backup

- Trên server linux dùng scp
```
sontest1#copy startup-config scp:
Address or name of remote host []? 172.16.5.11
Destination username [admin]? root
Destination filename [sontest1-confg]? /backup/cf.txt
Writing /backup/cf.txt
Password:
!
3426 bytes copied in 5.838 secs (587 bytes/sec)
```

- Trên máy win sử dụng phần mềm: `Tftpd64`

```
sontest1#copy startup-config tftp:
Address or name of remote host []? 172.16.5.103
Destination filename [sontest1-confg]?
!!
3426 bytes copied in 0.050 secs (68520 bytes/sec)
```

5. Auto backup

- BACKUP KRON
```
sontest1(config)#kron policy-list backup_s
sontest1(config-kron-policy)#cli show run | redirect tftp://172.16.5.103/test.txt
sontest1(config-kron-policy)#exit

sontest1(config)#kron occurrence backup_s at 17:28 Tue recurring
sontest1(config-kron-occurrence)#policy-list backup_s
sontest1(config-kron-occurrence)#exit

sontest1#sh kron schedule
Kron Occurrence Schedule
backup_s inactive, will run again in 0 days 00:00:42 at 17:28 on Tue

sontest1#sh kron schedule
Kron Occurrence Schedule
backup_s   active, will run again in 6 days 23:59:17 at 17:28 on Tue

# Kiểm tra: 
sontest1# sh running-config

kron occurrence backup_s at 17:28 Tue recurring
 policy-list backup_s
!
kron policy-list backup_s
 cli show run | redirect tftp://172.16.5.103/test.txt

```

- #BACKUP ARCHIVE

```
sontest1(config)#archive
sontest1(config-archive)#path tftp://172.16.5.103/$h
sontest1(config-archive)#time-period 2                #số phút giữa các bản backup
sontest1(config-archive)#write-memory
sontest1(config-archive)#end

sontest1#sh archive
The maximum archive configurations allowed is 14.
The next archive file will be named tftp://172.16.5.103/sontest1-<timestamp>-2
 Archive #  Name
   1        tftp://172.16.5.103/sontest1Nov--2-04-31-40.479-0
   2        tftp://172.16.5.103/sontest1Nov--2-04-33-43.308-1 <- Most Recent
   3
```

  - Restore:
  `copy tftp://172.16.5.103/sontest1Nov--2-04-31-40.479-0 startup-config`


6. Qos limit băng thông

```
sontest1(config)#mls qos
sontest1(config)#ip access-list extended ACL_1
sontest1(config-ext-nacl)#permit ip any any

sontest1(config)#class-map match-all CLASS_1
sontest1(config-cmap)#match access-group name ACL_1

sontest1(config)#policy-map POLICY_100Mbps
sontest1(config-pmap)#class CLASS_1
sontest1(config-pmap-c)#police 100000000 1000000 exceed-action drop

```
B6. Gán Policy cho cổng mạng muốn hạn chế tốc độ

GigabitEthernet0/2
service-policy input POLICY_100Mbps
Trong ví dụ này input là chiều đi vào cổng mạng (Client upload dữ liệu lên mạng)

Trường hợp ngược lại ouput là chiều đi ra khỏi cổng mạng (Client download dữ liệu về máy)
GigabitEthernet0/2
service-policy output POLICY_100Mbps